require("dotenv").config();
const { Client, IntentsBitField } = require('discord.js');

const client = new Client({
    intents: [
        IntentsBitField.Flags.Guilds,
        IntentsBitField.Flags.GuildMembers,
        IntentsBitField.Flags.GuildMessages,
        IntentsBitField.Flags.MessageContent,
    ]
})

const pasta1 = `Однажды по дороге в школу мне захотелось срать. Переборов в себе порывы, я решил добежать до школьного толкана и там извергнуть свое говно. Но каков был мой ужас, когда я обнаружил, что толкан не работает! А срать хотелось все больше.
Начался урок, но я не мог идти, я бы просто обосрался по дороге! Но, когда коридор опустел, я обнаружил рядом с собой чей-то портфель. Выбора у меня не оставалось, я расстегнул штаны, стянул труханы и начал срать в тот злосчастный портфель. Срал я очень долго и срал бы еще, если бы не послышались шаги. Все, что я успел сделать, это в спешке натянуть трусы и штаны на свою обосраную жопу, а затем встать по стойке смирно. Торопясь, я забыл застегнуть портфель и это станет огромной проблемой. 
Тут передо мной оказалась хозяйка портфеля - тян из параллельного, на которую я дрочил уже больше года (назовем ее для удобства Катей). Я стоял между ней и ее портфелем, так что она не могла видеть мое говно. 
Увидев меня, она покраснела и потупила взгляд. Я уже подумал было, что у меня ботинки или одежда в дрисне, но быстрый анализ происходящего дал понять, что, вроде бы, все нормально. 
И вдруг Катя начала что-то говорить. Всерьез озабоченный своей проблемой, я практически не слушал ее, а говорила она что-то про какие-то чувства ко мне. Этого мне только не хватало! Надо было срочно придумывать выход из ситуации. 
Еще мое положение несколько усложнялось тем, что мои штаны были не застегнуты и мне приходилось держать руки в карманах, чтобы они не спадали. 
— "Так что ты скажешь?" - вдруг пробился в мой мозг ее голос. 
— "Ну, э..." - старался я потянуть время - "Я влюблен в тебя второй уже второй год, и каждый день думаю только о тебе!" - с этого момента я начал нести какой-то бред, а она смотрела на меня взглядом, полным любви. 
Но в какой-то момент моя жопа начала подавать признаки того, что процесс калоизвержения далеко не закончен! Мой живот скрутило, послышались ужасающие звуки. Я уже понимал, что через несколько минут я обосрусь, а тогда и фейл неизбежен. 
Но в этот момент у Кати зазвонил телефон, а лежал он... В портфеле! 
А еще в портфеле лежала здоровенная куча моего дерьма. Это была самая хуевая и безвыходная ситуация в моей жизни. Тян устремилась к портфелю, но я пошел на последний отчаянный шаг. 
Подбежав к ней, я обнял ее, и наши губы слились в поцелуе! В этот же момент у меня встал член, и он на некоторое время задержал падение штанов с моей жопы. 
Катя прижалась ко мне, и я чудом смог спрятать стояк. От всей охуенности происходящего мне даже расхотелось срать. Я целуюсь с тян моей мечты, а в ее портфеле лежит мое говно. А еще шел урок. И в этот момент меня спас какой-то препод, который решил сходить в соседний кабинет. А так как мы прогуливали, нам с Катей оставалось только ретироваться на лестницу. Под шумок я застегнул штаны, но мы стояли уже на первом этаже.
И тут Катя заявляет: — "Может, пойдем ко мне домой?" Я был всей душой за, но нужно было что-то сделать с портфелем! 
Я высказал свое согласие, и тогда Катя без предупреждения пошла вверх за своим рюкзаком! Я молчал, как партизан, мысленно готовясь к полному краху своего счастья. 
Мы поднялись на этаж вверх, где лежал злосчастный портфель. И тут нас уже встречал тот препод. Началась немая сцена. Учитель с непониманием смотрел на нас с Катей, а та, в свою очередь, смотрела внутрь своего портфеля. 
Мы так стояли где-то минуту, пока я не спизданул преподу: — "Зачем вы насрали в портфель?" И тут начался пиздец. 
— "Вы неправильно поняли! Там уже было наложено!" Катя молча охуевала, потом схватила меня за руку и начала плакать. Я уже хотел было давать по съебкам, как моя жопа снова начала хотеть извергнуть очередную порцию говна. 
Преодолев и этот позыв, я начал съебывать, утягивая за собой Катю. Препод же настолько охреневал, что не мог даже пошевелиться и трясся. 
Через несколько секунд мы уже стояли в раздевалке и готовились к побегу. Я уже переобулся и был готов, как моя жопа будто сказала - не так быстро, чувак! 
Это был девятый вал. Я схватил первый попавшийся пакет от сменки и начал срать в него. 
В это время Катя искала свой пакет. На мое счастье, этот залп жопа произвела почти моментально. Я быстро повесил пакет на место, и, найдя Катю, хотел было съебывать из школы, как она спросила, не видел ли я желтый пакет с красными кружками. Тот самый, в который я только что насрал. 
Естественно, я ответил, что не видел, а сам, под видом того, что помогал его искать, быстро нашел его и перекинул через перегородку раздевалки. Но за перегородкой был коридор и выход из школы! Это я понял слишком поздно. 
И именно в этот момент Катя предложила мне свалить без пакета. Через секунду мы уже бежали к выходу, я надеялся, что она не заметит пакет. 
Но! Когда, казалось, все обошлось, мы увидели того самого препода, а вдобавок директора, завуча и охранника Петровича, смотрящих на обосранный пакет. 
И тут я ощутил охуенное дежавю и спизданул: — "Зачем вы насрали в пакет?" Препода тут же хватил удар, и он упал. Все начали вызывать скорую, а мы с Катей по тихому свалили. Она верила в то, что все засрал препод, и это было охуенно. Впереди был прекрасный день...`;
const pasta2 = `
Привет, Анон. Хочу поведать тебе историю, которая случилась со мной вчера. Итак, я кун 20 лвл. Стою вечером на остановке, никого не трогаю, жду автобус. Время 17:20 - 17:30. На остановке человека 4-5 стоит. Настроение хорошее, готов всем помочь кому не лень. И тут ко мне подходит мамаша лет 30 с личинкой и говорит: "Молодой человек, подержите пожалуйста ребенка, у меня сапоги расстегнулись, я застегну". Ну я взял личинку, она противно заревела. Мамка стала сапоги застегивать и как сорвалась с места и побежала. Я даже прихуел немного и секунды 2 слоупочил. Потом до меня дошло, что она хотела наебать меня и оставить мне личинку. Я сорвался с места и побежал за ней. Один поворот за дом налево, один двор пробежал, сразу направо. И тут я потерял её из поля зрения. Это пиздец, анон. Я - 20-летний хикка с орущей личинкой на руках стою и не понимаю, что делать.Постояв так секунд 20 я пошел по тротуару и стал у всех спрашивать, не видел ли кто женщину лет 30 в пуховике или зеленого или коричневого цвета. Никто ничего не говорил. Я уже пиздец как испугался и чуть не отложил кирпичей. Вдруг вижу в ближайшем дворе силуэт бегущей женщины. Сразу понял, что это она. Сердце бешено забилось и я побежал за ней. Сраный ребенок уже успел обслюнявить мою новую куртку, я немного отвлекся и въебался в ебучую скамейку, нога дико заболела. Но я увидел, что баба побежала к последнему подъезду и зашла в него.
Я пошел к подъезду немного прихрамывая. Спросил у бабок, сидящий на скамейке, что это за женщина зашла и знают ли они её? Они сказали что-то вроде: "Это Ленка с 7-го этажа, сумасшедшая совсем. Ты хахаль её новый? кококо, кудах кудах!". Ну я опять испугался и подумал, вызвать полицию или самому справиться. Решил, что поднимусь на 7 этаж, оставлю личинку у порога какого-нибудь, позвоню в дверь всем, авось кто возьмет её.Заходу в подъезд, лифт не работает. Пошел пешком. Это был просто пиздец, а не подъезд. Бычки валяются на полу, воняет мочой и дешевым куревом. На 1-3 этажах двери деревянные и обшарпаные. Ну и ладно. На 5 этаже передохнул, личинка орала. Какая-то бабка выглянула из квартиры, презрительно посмотрела на меня, что-то прокукарекала и исчезла. Поднимаюсь на 7 этаж, думаю куда положить этот ревущий кусок дерьма. Вижу, что дверь в одну из квартир приоткрыта. Открываю, боюсь, но вхожу. Спрашиваю, есть ли кто нибудь. Никто не отвечает. Подхожу к ближайшей двери, заглядываю внутрь и вижу, что на кровати лежит та самая баба, ревет, волосы растрепаны и закрывают её лицо. А перед ней стоит мужик, глубоко дышит, руки за спиной. 
Я говорю: "Я стоял на остановке, ко мне подошла она, дала ребенка и убежала. Это ваш сын?". Наговорил что-то подобное. Мужик на это только покачал головой, достал руки из-за спины, в руках у него был молоток. Вот тут то я не хило пересрался. Думал уже кинуть личинку и съебаться из этого дома домой, зайти на мой любимый двачик. Но мужик сказал: "Бери! И пизди его!" и показал на ребенка. Сказать, что я охуел, это не то слово. Я секунды 3 подумал, помешкался. Думаю, возьму молоток, ебану мужику по голове, сам вызову полицию и свалю. Мужик уже протягивает молоток и делает выражение лица, мол, держи и пизди выродка. Я беру молоток и стою в раздумьях. Решено. Ебашу по башке мужику. Решил постоять немного для вида, что готовлюсь. И вот стою я, молоток кручу-верчу, просыпаюсь - хуй дрочу.`
const pasta3 = `Это приятно, ни с чем не сравнить
Особенно теперь, когда дед лежит парализованный уже 5 лет. Я говорю – писю будем подудонивать? Письку-колбапиську? Он улыбается, радуется, аж подпрыгивает. Заваливается на бочок и смотрит на меня – на тот бочок? Правильно лег? Я молчу, дразню его. Он плюх – на другой бочок – внучок, а теперь так? С какой стороны писю будешь дудонить? Уже весь в сомнениях, переживает, начинает кататься с боку на бок. Где? Где будут писю дудонить? Ну где? Я смеюсь, дразню его, приговариваю – пися, писечка, писюлька, будем дудонить! Ложусь рядом. Он быстро переворачивается на нужный бочок, поджимает ножки, выставляет вперед ручки – чтобы писю мять, широко открывает ротик, закрывает глазки. Все! На подудоньку писи рота построена, вставляйте и поехали. Хам-ам-ам! Жадно и нетерпеливо сосет, молочка все нет. Открывает глаза, вопросительно смотрит на меня – ну где? И вот пися напряглась, иголочки пробежали по коже. Дедок жадно с удвоенной силой начинает сосать. Первый голод утолен и можно смаковать – лениво посасывать, теребить внукову майку, сопеть, бросать писю и разглядывать обои, вертеть попой, снова сосать. Наконец уснул. Такой сладкий, мой сдобный кулебяк! Никто не видит его таким – смотрю сверху – блестящая лысина, впалые щечки, тощие руки и ноги, обоссаное покрывало. Спит и причмокивает, о чем-то грустно вздыхая. Тихонько отбираю писю, крадучись встаю. А он так и лежит на бочке, выставив вперед ручки, поджав ножки. Чмокает ртом, думает, что все еще сосет писю. Это наши самые нежные, самые заветные мгновения. Ради них стоит и чаи спермогонные пить литрами, и раздаиваться, и воевать с дедулей, когда ему в очередной раз придет в головешку идея отказаться от писи. Как жалко, что он не запомнит этого! Ребята, настраивайтесь на ГВ. Сначала будет тяжело – и трещины могут быть, и многочасовые висения на писе, и, не дай бог, спермостаз, и спермокризы, когда вы ревете в один голос с голодным дедулей… А может вы с первых дней будете кормить, как дышать, ведь каждый внук уже родился с этой способностью – выкормить своего деда. Все можно преодолеть, это такое счастье – кормить своего парализованного деда писей!`;
const pasta4 = `Привет срам, мне 15, задрот, не троль, не лжец, да и вроде как не девственник... Наверное. Начну.

Я живу в разъебанном поселке, у меня есть старшая сестра, мама и отец. Мой отец довольно таки заядлый рыболов. Он частенько приносит домой очень крупных карпов, сомов, щук и судаков. Но больше всего мне нравились карпы, золотые гиганты.

Год назад я сидел дома и дрочил на порнуху. Дрочу я значит и слышу, как на улице очень радостно идет мой отец со своими друзьями. Я быстро вырубил порнуху и врубил скайрим. Кампашка моего отца зашла, я встал из за компа, чтоб встретить их, и тут я увидел, что мой отец держит в руках трофейного 9ти киллограмового карпа. Я разделил с ним его триумф. Папа оставил карпа дома в мокром одеяле и ушел бухать в бар вместе с друзьями. Я остался дома один и решил рассмотреть карпа получше.

Он был еще жив и двигал своим гигантским ртом. Тут я представил себе, хз зачем, что этот карп отсасывает у меня. Тут я почувствовал, что у меня встал мой хер. Думаю, вы уже додумались, что я сделал, я выебал карпа в его рот с необыкновенно мясистыми губами, и кончил я тоже прямиком ему в рот. При это м испытал необыкновенное удовольствие.

Потом я забыл про этот случай, тем более, что того карпа папа продал на рынке. Но, когда отец приносил маленьких карпов по килограмму, по два, то я стал ебать и их. Весь год я ебал карпов и сазанов, причем маленьких карпиков было ебать приятнее, тк рот у них был как раз под мои причендалы. Я любил ебать их живыми, когда они еще двигали своими губами по моему хуйцу. За пол года я перетрахал, наверное более 40, может и 50 карпов. Я ебал их по нескольку раз в день, кончал им в анал, хз зачем, иногда я дотоахивал их, когда они были уже заморожены в холодильнике, правда это у меня было на черный день. Один раз я даже попытался выебать леща, когда карпов не было, но рот у него был мелковат. Один раз я выебал голавля, но все равно, самыми лучшими для меня были именно карпики, и когда отец спрашивал, на кого ему завтра пойти, то я всегда уговаривал его наловить карпов, мол мясо у них оч вкусное.

Тут произошло следующее. Примерно неделю мой отец не ловил карпов. Неделю я не ебал карпов. Я ходил как в тумане, мне очень хотелось выебать очередную рыбу, я подумывал самому поймать карпа, но мне лень, тем более, что рыбалку я ненавижу. Отец принес за всю неделю только одну маленькую щучку, вероятно потому, что была поздняя осень, и он говорил, что карпов сейчас ловить не интересно или чото такое. Я помню, он уже вроде как начал что то подозревать по поводу моей карповой мании, но я все равно отмазывался, мол просто нравится мне эта рыба и все.

Мой отец принес домой 8ми киллограмового сома. Мне очень хотелось поебаться с рыбой и тут я присмотрелся к сому. А что, рот что надо, вот только щетка сомовья, но она как правило ничего не может сделать, максимум поцарапать, если очень сильно прижаться к ней. Ну, думаю, ладно, сойдет. Я оголил хуй, надрочил его немного, засунул в рот живому сому, который кстати был в тазе с водой, и начал ебать его в рот. Я ебал его еще немного, но через минуту произошел ужас. Сом сжал мой хуец, и вроде хотел вырвать его, но у него это не получилось, он просто очень сильно провел своей щеткой по моему хую. Я сразу вынул его, он был пздц как исцарапан, из него шла кровь, я ебнул сома ногой, и он упал в свой таз с водой. Кровь сочилась из моего хуя ручьем. Я блять перебинтовал его, намазал спиртом. Затем я вытер кровь с пола. Хуй болел очень сильно. Он сильно опухал, но потом прошел, однако шрамы остались. Хорошо, что хоть никто так и не узнал что я ебал рыб, и что ходил с бинтом на хую. И вот, хуй у меня прошел через месяц полностью. Всю зиму я никого не ебал, а тут мой отец весной снова начал приносить с рыбалки карпов, и я снова стал их ебать. Последнего карпа я выебал позавчера. Самое главное, что на сиськи, и просто телок у меня уже не стоит, а как только я вижу рожу карпа, так я сразу возбуждаюсь. От меня хуй провонял рыбой настолько, что отмыть его уже невозможно. Так это чо выходит, я рыбофил какой то ? Я нормален ваще ?`



function pastaSplitter(pasta) { 
    const regexPattern = /\s+/g;
    const spacelessPasta = pasta.replace(regexPattern, " ");
    const result = spacelessPasta.match(/.{1,2000}/g) ?? [];
        return result
    }

const pastasArr = [pasta1, pasta2, pasta3, pasta4];


client.on('ready', (c) => {
    console.log(`${c.user.tag} is gaуy!`)
});

client.on('messageCreate', (message) => {
    if (message.content === "!help") {
        message.reply(`!pasta - случайная паста`
        );
       
    }
})
 
client.on('messageCreate', (message) => {
    if (message.content === "!pasta") {
        const randomPasta = Math.floor(Math.random() * pastasArr.length);

        const splittedPasta = pastaSplitter(pastasArr[randomPasta]);
        splittedPasta.map(i => message.reply(i));
        
    }
})


client.login(process.env.TOKEN);